2023-11-17/1d12211c12-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TTY文档翻译</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">TTY文档翻译</h1>
<p>
<code>=</code>
TTY
<code>=</code>
TTY层关心所有的串口设备。
</p>


<p>
TTY structures
<code>=</code>
有几种主要的TTY结构。
= N tty devices
= N struct tty_port
= 1 tty_driver
tty_driver描述了tty层驱动，同样包含一个ops指针(tty_operations)。ops用来操作TTYs。
调用open函数时，一个struct tty_struct被分配实例，直到最后close。在此期间，几个
tty_operations中的回调函数会由TTY层调用。
Kernel接收到的每个字符(来自底层硬件devices或上层用户users)经过一个预处理阶段tty_ldisc.
ldisc的任务是转换某些字符，而转换规则由ldisc或user定义。默认的一个是n_tty，实现了
echo，信号处理，任务控制，特殊字符处理等等。
</p>

<p>
tty_driver
tty_port
tty_struct
tty_ldisc
tty_buffer
tty_internals
</p>

<p>
Write TTY Driver
<code>=</code>
写TTY驱动之前，必须考虑Serial和USB Serial层。串口设备驱动经常使用这两个中的一个来实现
串口驱动。只有特殊设备需要直接由TTY层处理。
</p>

<p>
一个典型的TTY驱动执行顺序：
</p>
<ol class="org-ol">
<li>分配并注册一个TTY驱动(module init)</li>
<li>探索到TTY设备时，创建并注册(probe function)</li>
<li>处理TTY ops和中断事件等事件(TTY core invokes the former, the device the latter)</li>
<li>移除设备(remove function)</li>
<li>unregister and free the TTY driver(module exit)</li>
</ol>


<p>
TTY Driver and TTY Operations
<code>=</code>
</p>

<p>
Allocation
<code>=</code>
tty_driver层做的第一件事情就是由tty_alloc_driver()分配一个tty_driver。然后给新创建
的实例填充信息。
</p>

<p>
Registration
<code>=</code>
当tty_driver分配好并初始化填充之后，使用tty_register_driver()注册。flags参数推介使用
TTY_DRIVER_DYNAMIC_DEV。
</p>

<p>
Registering Devices
<code>=</code>
每一个tty设备应该有一个tty_port支持。通常，TTY驱动将tty_port嵌入到设备的私有数据结构。
</p>

<p>
翻译也不好理解，还是看代码去</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
